Tekla Open API Reference for Tekla Structures 2025
ClashCheckOptions Class
The ClashCheckOptions class represents the clash check options.
Inheritance Hierarchy
System.Object
 Tekla.Structures.ClashCheckOptions
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class ClashCheckOptions
<SerializableAttribute>
Public NotInheritable Class ClashCheckOptions
The ClashCheckOptions type exposes the following members.
Constructors
Name | Description
ClashCheckOptions
Initializes a new instance of the ClashCheckOptions class
Top
Properties
Name | Description
BoltHeadDiameter
The bolt head diameter.
NutThickness
The nut thickness.
Top
See Also
Reference
Tekla.Structures Namespace